core/app/Http/Controllers/Staff/CourierController.php

    public function create()
    {
        $pageTitle = "Courier Send";
        $branchs = Branch::where('status', 1)->latest()->get();
        $types = Type::where('status', 1)->with('unit')->latest()->get();
---
select * from `branches` where `status` = 1 order by `created_at` desc
select * from `types` where `status` = 1 order by `created_at` desc
select * from `units` where `units`.`id` in (1, 2)


        $totalAmount = 0;
        for ($i=0; $i <count($request->courierName); $i++) {
            $courierType = Type::where('id',$request->courierName[$i])->where('status', 1)->firstOrFail();
---
select * from `types` where `id` = '2' and `status` = 1 limit 1

            $courierProduct->courier_type_id = $courierType->id;
            $courierProduct->qty = $request->quantity[$i];
            $courierProduct->fee = $request->quantity[$i] * $courierType->price;
            $courierProduct->save();
---
insert into `courier_products` (`courier_info_id`, `courier_type_id`, `qty`, `fee`, `updated_at`, `created_at`) values (43, 2, '1', 1, '2022-11-03 02:48:41', '2022-11-03 02:48:41')

        $courierPayment->courier_info_id = $courier->id;
        $courierPayment->amount = $totalAmount;
        $courierPayment->status = 0;
        $courierPayment->save();
---
insert into `courier_payments` (`courier_info_id`, `amount`, `status`, `updated_at`, `created_at`) values (43, 1, 0, '2022-11-03 02:48:41', '2022-11-03 02:48:41')

        $adminNotification->user_id = $sender->id;
        $adminNotification->title = 'Dispatch Courier '.$sender->username;
        $adminNotification->click_url = urlPath('admin.courier.info.details',$courier->id);
        $adminNotification->save();
---
insert into `admin_notifications` (`user_id`, `title`, `click_url`, `updated_at`, `created_at`) values (8, 'Dispatch Courier mubasher92', '/admin/courier/details/43', '2022-11-03 02:48:41', '2022-11-03 02:48:41')

    public function invoice($id)
    {
        $pageTitle = "Invoice";
        $courierInfo = CourierInfo::where('id', decrypt($id))->first();
        $courierProductInfos = CourierProduct::where('courier_info_id', $courierInfo->id)->with('type')->get();
        $courierPayment = CourierPayment::where('courier_info_id', $courierInfo->id)->first();
---
select * from `courier_infos` where `id` = 43 limit 1
select * from `courier_products` where `courier_info_id` = 43
select * from `types` where `types`.`id` in (2)
select * from `courier_payments` where `courier_info_id` = 43 limit 1

    public function manageCourierList()
    {
        $user = Auth::user();
        $pageTitle = "All Courier List";
        $emptyMessage = "No data found";
        $courierLists = CourierInfo::where('sender_branch_id', $user->branch_id)->orWhere('receiver_branch_id', $user->branch_id)->orderBy('id', 'DESC')->with('senderBranch', 'receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());
---
select * from `branches` where `branches`.`id` in (1, 4)
select * from `courier_infos` where `sender_branch_id` = 4 or `receiver_branch_id` = 4 order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courier_infos` where `sender_branch_id` = 4 or `receiver_branch_id` = 4

    public function delivery()
    {
        $user = Auth::user();
        $pageTitle = "Courier Delivery List";
        $emptyMessage = "No data found";
        $courierDeliveys = CourierInfo::where('receiver_branch_id', $user->branch_id)->orderBy('id', 'DESC')->with('senderBranch','receiverBranch', 'senderStaff', 'receiverStaff', 'paymentInfo')->paginate(getPaginate());
---
select * from `branches` where `branches`.`id` in (1)
select * from `courier_infos` where `receiver_branch_id` = 1 order by `id` desc limit 20 offset 0
select count(*) as aggregate from `courier_infos` where `receiver_branch_id` = 1

    public function payment(Request $request)
    {
        $request->validate([
            'code' => 'required|exists:courier_infos,code'
        ]);
        $user = Auth::user();
        $courier = CourierInfo::where('code', $request->code)->where('status', 0)->firstOrFail();
        $courierPayment = CourierPayment::where('courier_info_id', $courier->id)->where('status', 0)->firstOrFail();
        $courierPayment->receiver_id = $user->id;
        $courierPayment->branch_id = $user->branch_id;
        $courierPayment->date = Carbon::now();
        $courierPayment->status = 1;
        $courierPayment->save();

        $adminNotification = new AdminNotification();
        $adminNotification->user_id = $user->id;
        $adminNotification->title = 'Courier Payment '.$user->username;
        $adminNotification->click_url = urlPath('admin.courier.info.details',$courier->id);
        $adminNotification->save();
---
select * from `courier_infos` where `code` = 'T5CKCSVUD2Z7' and `status` = 0 limit 1
select * from `courier_payments` where `courier_info_id` = 43 and `status` = 0 limit 1
update `courier_payments` set `receiver_id` = 8, `branch_id` = 1, `date` = '2022-11-03 02:49:16', `status` = 1, `courier_payments`.`updated_at` = '2022-11-03 02:49:16' where `id` = 43
insert into `admin_notifications` (`user_id`, `title`, `click_url`, `updated_at`, `created_at`) values (8, 'Courier Payment mubasher92', '/admin/courier/details/43', '2022-11-03 02:49:16', '2022-11-03 02:49:16')